app/views/articles/_form.html.erb

          <div class="col-10">
            <%= f.collection_select :category_ids, Category.all, :id, :name, {prompt:"Select a category ( can be empty )"} , {multiple: true, size: 3, class: "form-select"} %>
---
SELECT "categories".* FROM "categories"