app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    #checks if @current_user already exist, if not then does the User.find(session[:user_id]) query
    #and assigns to @current_user the returned value. (it checks if session[:user_id] first)
    @current_user ||= User.find(session[:user_id]) if session[:user_id]