app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Some title"], ["created_at", "2023-05-26 05:04:27.479781"], ["updated_at", "2023-05-26 05:04:27.479781"], ["description", "Some description"], ["user_id", 2]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save

UPDATE "articles" SET "updated_at" = $1, "description" = $2 WHERE "articles"."id" = $3  [["updated_at", "2023-05-18 19:54:34.442603"], ["description", "edited - description of first article"], ["id", 1]]
---
  def update
    if @article.update(article_params)