app/controllers/users_controller.rb

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "i-will-be-deleted"], ["email", "delete@example.com"], ["created_at", "2023-05-29 00:10:51.198860"], ["updated_at", "2023-05-29 00:10:51.198860"], ["password_digest", "[FILTERED]"]]