app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "erick"], ["email", "erick@example.com"], ["created_at", "2023-05-26 20:46:10.175021"], ["updated_at", "2023-05-26 20:46:10.175021"], ["password_digest", "[FILTERED]"]]